title: Magnet RAM Capture Driver Load
description: Detects the load of Magnet RAM Capture driver
id: a424b4d1-18de-4d3e-8eac-8170a6637fad
author: Arctic Wolf Labs
status: experimental
date: 30/01/2023
references:
    - https://arcticwolf.com/resources/blog/lorenz-ransomware-getting-dumped
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: driver_load
    product: windows
detection:
    selection_sysmon:
        Hashes|contains:
        - 'MD5=35AEF87E63302FB7273870CFF3117279'
        - 'SHA1=68DBAAB0C6C9D5763E3C714C82F96C3B677DB7E8'
        - 'SHA256=5FFF657939E757922941162376ADB86B7A37DC329A1F9969C70F23E7D54B7B4C'
        - 'MD5=FFDC58CD04A6E6295725F1C9B9C0D0CE'
        - 'SHA1=CB330E630E7A3E65EFB3DF3FB34EFF5404B83745'
        - 'SHA256=3766619B7564F84185CF8CC952EE5513C45C6D858EF971C5FD1B0BDF234B8BAA'
        - 'MD5=F6D77EF0B07B6FFF1B91357C890DCF88'
        - 'SHA1=5D7982AD6CA4133CD0FAE1904DDE4DA907E54B54'
        - 'SHA256=C0CAFFD00B9576725ACF9DBE15AF8FC64EA000CB527F1FBCAA3CBDCF52C99152'
        - 'MD5=1DD0E3E168B5B4704583B59E0F5A63A2'
        - 'SHA1=B7C36CEA181D69AA7432C81C5013AE539E7B708B'
        - 'SHA256=654629028CF878126A25B8449B5F1AC4D828B5ADC03BB393062D46415A78F39B'
    selection_hash:
       - MD5:
            - '35AEF87E63302FB7273870CFF3117279'
            - 'FFDC58CD04A6E6295725F1C9B9C0D0CE'
            - 'F6D77EF0B07B6FFF1B91357C890DCF88'
            - '1DD0E3E168B5B4704583B59E0F5A63A2'
       - SHA1: 
            - '68DBAAB0C6C9D5763E3C714C82F96C3B677DB7E8'
            - 'CB330E630E7A3E65EFB3DF3FB34EFF5404B83745'
            - '5D7982AD6CA4133CD0FAE1904DDE4DA907E54B54'
            - 'B7C36CEA181D69AA7432C81C5013AE539E7B708B'
       - SHA256:  
            - '5FFF657939E757922941162376ADB86B7A37DC329A1F9969C70F23E7D54B7B4C'
            - '3766619B7564F84185CF8CC952EE5513C45C6D858EF971C5FD1B0BDF234B8BAA'
            - 'C0CAFFD00B9576725ACF9DBE15AF8FC64EA000CB527F1FBCAA3CBDCF52C99152'
            - '654629028CF878126A25B8449B5F1AC4D828B5ADC03BB393062D46415A78F39B'
    driver_status:
        - Signed: 'true'
    driver_sig:
        - Signature|contains: ' Magnet Forensics Inc.'
    condition: 1 of selection* or all of driver_*
falsepositives:
    - Legitimate usage of Magnet RAM Capture or other (Magnet Forensics) software using the driver
level: low
