title: Magnet RAM Capture Driver Load
description: Detects the load of Magnet RAM Capture driver
id: a424b4d1-18de-4d3e-8eac-8170a6637fad
author: Arctic Wolf Labs
status: experimental
date: 30/01/2023
modified: 23/02/2023
references:
    - https://arcticwolf.com/resources/blog/lorenz-ransomware-getting-dumped
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: driver_load
    product: windows
detection:
    selection_sysmon:
        - Hashes|contains:
            - 'MD5=35AEF87E63302FB7273870CFF3117279'
            - 'SHA1=68DBAAB0C6C9D5763E3C714C82F96C3B677DB7E8'
            - 'SHA256=5FFF657939E757922941162376ADB86B7A37DC329A1F9969C70F23E7D54B7B4C'
            - 'MD5=FFDC58CD04A6E6295725F1C9B9C0D0CE'
            - 'SHA1=CB330E630E7A3E65EFB3DF3FB34EFF5404B83745'
            - 'SHA256=3766619B7564F84185CF8CC952EE5513C45C6D858EF971C5FD1B0BDF234B8BAA'
            - 'MD5=F6D77EF0B07B6FFF1B91357C890DCF88'
            - 'SHA1=5D7982AD6CA4133CD0FAE1904DDE4DA907E54B54'
            - 'SHA256=C0CAFFD00B9576725ACF9DBE15AF8FC64EA000CB527F1FBCAA3CBDCF52C99152'
            - 'MD5=1DD0E3E168B5B4704583B59E0F5A63A2'
            - 'SHA1=B7C36CEA181D69AA7432C81C5013AE539E7B708B'
            - 'SHA256=654629028CF878126A25B8449B5F1AC4D828B5ADC03BB393062D46415A78F39B'
            - 'IMPHASH=99ABE3BC6F5A07246949FFC36BC1F543'
    selection_hash:
        - Imphash: '99abe3bc6f5a07246949ffc36bc1f543'
        - MD5:
            - '35aef87e63302fb7273870cff3117279'
            - 'ffdc58cd04a6e6295725f1c9b9c0d0ce'
            - 'f6d77ef0b07b6fff1b91357c890dcf88'
            - '1dd0e3e168b5b4704583b59e0f5a63a2'
        - SHA1:
            - '68dbaab0c6c9d5763e3c714c82f96c3b677db7e8'
            - 'cb330e630e7a3e65efb3df3fb34eff5404b83745'
            - '5d7982ad6ca4133cd0fae1904dde4da907e54b54'
            - 'b7c36cea181d69aa7432c81c5013ae539e7b708b'
        - SHA256:
            - '5fff657939e757922941162376adb86b7a37dc329a1f9969c70f23e7d54b7b4c'
            - '3766619b7564f84185cf8cc952ee5513c45c6d858ef971c5fd1b0bdf234b8baa'
            - 'c0caffd00b9576725acf9dbe15af8fc64ea000cb527f1fbcaa3cbdcf52c99152'
            - '654629028cf878126a25b8449b5f1ac4d828b5adc03bb393062d46415a78f39b'
    driver_status:
        - Signed: 'true'
    driver_sig:
        - Signature|contains: ' Magnet Forensics Inc.'
    condition: 1 of selection* or all of driver_*
falsepositives:
    - Legitimate usage of Magnet RAM Capture or other (Magnet Forensics) software using the driver
level: medium
