title: Execution of Magnet RAM Capture
description: Detects Execution of Magnet RAM Capture
id: 8cc3e59e-e697-44e7-b55c-f7712c00767e
author: Arctic Wolf Labs
status: experimental
date: 30/01/2023
references:
  - https://arcticwolf.com/resources/blog/lorenz-ransomware-getting-dumped
tags:
   - attack.credential_access
   - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_pe:
        - Description: Magnet RAM Capture
        - Product: Magnet RAM Capture
        - Company:  Magnet Forensics Inc.
    selection_cmd:
        CommandLine|contains|all:
        - '/accepteula'
        - '/go'
        - '/silent'
    condition: all of selection_pe or all of selection_cmd
falsepositives:
    - Legitimate use
level: low
